import {Accordion, AccordionContent, AccordionItem, AccordionTrigger} from "@/components/ui/accordion";
import { UserType } from "@/lib/types";

export default function FAQ({ type }: {type: UserType}) {
  const faqs_candidate: { id: string, ask: string, answer: string }[] = [
    {
      id: "haveToRegister",
      ask: "Обязательно ли мне регистрироваться, чтобы найти идеи для портфолио?",
      answer: "Нет, не обязательно.",
    },
    {
      id: "difference",
      ask: "Чем мы отличаемся?",
      answer: "Всем",
    },
    {
      id: "canIPublic",
      ask: "Могу ли я опубликовать свою задачу?",
      answer: "Да",
    },
    {
      id: "canDelete",
      ask: "Как я могу удалить свои данные с вашего сервиса?",
      answer: "Потом скажем",
    },
  ]

  const faqs_employer: { id: string, ask: string, answer: string }[] = [
  {
    id: "testTaskOrReal",
    ask: "Чем ваши задачи отличаются от обычных тестовых заданий, которые мы даем на собеседованиях?",
    answer: "Обычное тестовое задание соискатель делает в вакууме, часто за 1-2 дня, и вы видите только финальный результат. На нашей платформе задачи разбиты на этапы (как в реальной работе), кандидат ведет проект от проектирования БД до деплоя, а вы видите историю его коммитов, скорость принятия решений и то, как он справляется с трудностями. Это дает более полную картину, чем просто «сдал/не сдал».",
  },
  {
    id: "hireWithoutInterview",
    ask: "Могу ли я нанять кандидата, не проводя классическое собеседование?",
    answer: "Да. Если кандидат успешно выполнил ваше тестовое задание, а его код прошел нашу AI-проверку и получил высокую оценку, вы можете сразу отправить ему оффер или предложить стажировку. Мы рекомендуем короткий 15-минутный созвон (culture fit), чтобы убедиться в совпадении ожиданий, но жесткая необходимость в техническом интервью отпадает — вы уже видели, как он пишет код и справляется с задачами.",
  },
  {
    id: "candidateControl",
    ask: "Могу ли я ограничить доступ к задаче конкретными кандидатами?",
    answer: "Да, вы можете сделать задачу приватной и отправить персональные ссылки-приглашения только тем кандидатам, чьи профили и историю решений вы уже изучили в каталоге. Также вы можете установить лимит на количество принимаемых решений (например, «жду первые 5 решений»), чтобы не перегружать тимлида проверкой.",
  },
  {
    id: "cancelTask",
    ask: "Что будет, если я пойму, что задача составлена неверно или передумал искать?",
    answer: "Вы можете удалить задачу или снять ее с публикации в любой момент, пока ни один кандидат не нажал «Начать выполнение». Если кто-то уже взял задачу в работу, вы можете отменить ее, но кандидат получит компенсацию за потраченное время (если задача была с оплатой за решение), а ваш рейтинг надежности работодателя временно снизится.",
  },
];

  const faqs_mentor: { id: string, ask: string, answer: string }[] = [
  {
    id: "howGetPaid",
    ask: "Как я буду получать оплату за проверку решений и консультации?",
    answer: "Вы сами устанавливаете стоимость своих услуг. После того как соискатель оплачивает сессию, деньги замораживаются на платформе до момента проведения встречи. После успешного созвона платформа переводит вам средства за вычетом комиссии сервиса (20%). Выплаты происходят раз в неделю.",
  },
  {
    id: "timeLimits",
    ask: "Сколько времени мне нужно уделять и есть ли обязательные нормы (KPI)?",
    answer: "У нас нет жестких норм. Вы сами выбираете свою загрузку: можете брать 1 заявку в месяц или 20. Однако для того, чтобы ваш профиль имел статус «Проверенный ментор» и отображался в топе каталога, вам необходимо проводить минимум 2 успешные консультации в месяц и поддерживать высокий рейтинг (не ниже 4.8).",
  },
  {
    id: "unfairRating",
    ask: "Что делать, если ученик поставил низкую оценку, потому что ожидал другого результата?",
    answer: "Мы защищаем репутацию экспертов. Если ученик ставит оценку ниже 4 звезд, платформа автоматически запрашивает у него текстовый отзыв с обоснованием. Вы можете оспорить несправедливую оценку в течение 48 часов, прикрепив запись созвона или переписку. Если модерация увидит, что оценка необоснованна (например, ученик просил написать код за него, а вы отказались), отзыв будет аннулирован, а рейтинг восстановлен.",
  },
  {
    id: "ipProtection",
    ask: "Что делать, если ученик скопирует мой код или начнет предлагать платные услуги моим ученикам в обход платформы?",
    answer: "Все менторы подписывают NDA, а соискатели — пользовательское соглашение, которое запрещает копировать код эксперта без разрешения и уводить клиентов в обход платформы. Если вы заметили нарушение, нажмите кнопку «Пожаловаться» в чате — мы заблокируем аккаунт нарушителя, а в случае прямого воровства кода поможем составить претензию. Кроме того, мы скрываем ваши контактные данные (Telegram, почту) до момента оплаты сессии, чтобы минимизировать риск прямых обходов.",
  },
];

  let final_faqs;
  switch (type) {

    default:
    case 'candidate':
      final_faqs = faqs_candidate;
      break;
    
    case 'employer':
      final_faqs = faqs_employer;
      break;
    
    case 'mentor':
      final_faqs = faqs_mentor;
      break;
      
  }

  return (
    <Accordion className="w-3/4">
      {
        final_faqs.map((question) => (
          <AccordionItem value={question.id} key={question.id}>
            <AccordionTrigger className="font-heading text-lg">{ question.ask }</AccordionTrigger>
            <AccordionContent>{ question.answer }</AccordionContent>
          </AccordionItem>
        ))
      }
    </Accordion>
  );
}